In [1]:
import pandas as pd
import numpy as np

In [2]:
y=pd.read_csv('/content/Salaries.csv')

In [3]:
y

          Id       EmployeeName  ...         Agency  Status
0          1     NATHANIEL FORD  ...  San Francisco     NaN
1          2       GARY JIMENEZ  ...  San Francisco     NaN
2          3     ALBERT PARDINI  ...  San Francisco     NaN
3          4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4          5    PATRICK GARDNER  ...  San Francisco     NaN
...      ...                ...  ...            ...     ...
40404  40405        David Parry  ...  San Francisco     NaN
40405  40406       Francisco Ho  ...  San Francisco     NaN
40406  40407    Manuel Gonzales  ...  San Francisco     NaN
40407  40408     Lauro Baca III  ...  San Francisco     NaN
40408  40409    Milagros Brosas  ...            NaN     NaN

[40409 rows x 13 columns]

In [4]:
y.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

In [5]:
y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40409 entries, 0 to 40408
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                40409 non-null  int64
 1   EmployeeName      40409 non-null  object
 2   JobTitle          40409 non-null  object
 3   BasePay           40408 non-null  float64
 4   OvertimePay       40408 non-null  float64
 5   OtherPay          40408 non-null  float64
 6   Benefits          4249 non-null   float64
 7   TotalPay          40408 non-null  float64
 8   TotalPayBenefits  40408 non-null  float64
 9   Year              40408 non-null  float64
 10  Notes             0 non-null      float64
 11  Agency            40408 non-null  object
 12  Status            0 non-null      float64
dtypes: float64(9), int64(1), object(3)
memory usage: 4.0+ MB

what is the average BasePay?

In [6]:
y['BasePay'].mean()

71096.68577757079

what is the highest amount of OvertimePay in the dataset?

In [7]:
y['OvertimePay'].max()

245131.88

what is the job title of JOSEPH DRISCOLL? Note: Use all caps,otherwise you may get answer that doesn't match up

In [8]:
y[y['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle'	]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

HOW MUCH DOES JOSEPH DRISCOLL MAKE(INCLUDING BENEFITS)?

In [9]:
y['TotalPayBenefits'] [y['EmployeeName']== 'JOSEPH DRISCOLL']

24    270324.91
Name: TotalPayBenefits, dtype: float64

WHAT IS THE NAME OF THE HIGHEST PAID PERSON(INCLUDING BENEFITS)?

In [10]:
y[y['TotalPay'].max()==y['TotalPay']]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

WHAT IS THE NAME OF THE LOWEST PAID PERSON(INCLUDING BENEFITS)?

In [11]:
y[y['TotalPay'].min()==y['TotalPay']]

          Id        EmployeeName  ...         Agency  Status
36156  36157      PAULETTE ADAMS  ...  San Francisco     NaN
36157  36158       KAUKAB MOHSIN  ...  San Francisco     NaN
36158  36159  JOSEPHINE MCCREARY  ...  San Francisco     NaN

[3 rows x 13 columns]

WHAT WAS THE AVERAGE(MEAN) BasePay OF ALL EMPLOYEES PER YEAR? (2011-2014)

In [12]:
y.groupby('Year').mean()['BasePay']

Year
2011.0     63595.956517
2012.0    134927.909440
Name: BasePay, dtype: float64

HOW MANY UNIQUE JOB TITLES ARE THERE?

In [13]:
y['JobTitle'].nunique()

1284

WHAT ARE THE TOP 5 MOST COMMON JOBS?

In [14]:
y['JobTitle'].value_counts().head()

TRANSIT OPERATOR    2388
SPECIAL NURSE       1402
REGISTERED NURSE    1219
CUSTODIAN            796
FIREFIGHTER          794
Name: JobTitle, dtype: int64

HOW MANY JOB TITLES WERE REPRESENTED BY ONLY ONE PERSON IN 2013?(EG: JOB TITLE WITH ONLY ONE OCCURENCE IN 2013)

In [15]:
(y[y['Year']==2013]['JobTitle'].value_counts()==1).sum()

0

HOW MANY PEOPLE HAVE THE WORD CHIEF IN THEIR JOB TITLE?

In [16]:
y['JobTitle'].apply(lambda str:('chief' in str.lower())).sum()

291

In [17]:

def find_chief(job_title):    
    if 'chief' in job_title.lower().split():
        return True
    else:
        return False

df = pd.read_csv('Salaries.csv')

sum(df['JobTitle'].apply(lambda x: find_chief(x)))

211